{
	"Ola": "Hello",
	"_comment": "navbar",
	"Pagina inicial": "Home page",
	"Linguagens": "Languages",
	"Padrões": "Patterns",
	"Sobre": "About",
	"Usuário": "User",
	"Perfil": "Profile",
	"Sair": "Logout",
	"Pesquisar": "Search",
	"Entrar": "Login",
	"Desenvolvido por LabES": "Developed by LabES",
	"Avenida Trabalhador São Carlense, 400 - Centro": "Trabalhador São Carlense Avenue, 400 - Centro",
	"Universidade de São Paulo - ICMC Prédio 5 - Sala 6-208": "University of São Paulo - ICMC Block 5 - 6-208",
	"São Carlos - SP 13566-590 - Brasil": "São Carlos - SP 13566-590 - Brazil",
	"Telefone: (16) 3373-9997": "Phone: (16) 3373-9997",
	"Conecte-se conosco": "Connect with us",
	"Cadastro de usuário": "User registration",
	"Crie já sua conta": "Create your account",
	"Cadastre-se": "Register",
	"Universidade de São Paulo": "Universidade de São Paulo",
	"Crie já sua conta e comece a utilizar a plataforma.": "Create your account and start using the platform.",
	"Seu nome": "Your name",
	"Digite seu nome": "Type your name",
	"Seu E-mail": "Your E-mail",
	"Digite seu e-mail": "Type your E-mail",
	"Senha": "Password",
	"Digite sua senha (mínimo de 4 caracteres)": "Type your password (minimun of 4 characters)",
	"Confirme sua senha": "Confirm your password",
	"Terminar Cadastro": "Register",
	"Escolha um Template já existente": "Choose a template",
	"Nome": "Name",
	"Contexto": "Context",
	"Figura": "Figure",
	"Problema": "Problem",
	"Solução": "Solution",
	"Diagrama da solução": "Diagram solution",
	"Descrição": "Description",
	"Alias": "Alias",
	"Forças": "Forces",
	"Exemplo": "Example",
	"Usos conhecidos": "Known uses",
	"Padrões relacionados": "Related patterns",
	"Resultante": "Resulting",
	"Rationale": "Rationale",
	"Crie um novo template": "Create a new template",
	"Digite aqui o nome de seu novo template": "Type here your new template name",
	"Digite aqui o título do elemento": "Type your element title",
	"Classificação": "Classification",
	"Motivação": "Motivation",
	"Consequências": "Consequences",
	"Contexto resultante": "Resulting context",
	"Justificativa": "Justification",
	"Adicionar elemento": "Add element",
	"Criar Padrão": "Create pattern",
	"Cancelar": "Cancel",
	"Criação de Novo Padrão": "New Pattern",
	"Observações": "Observations",
	"1 - Para melhor utilização do usuário, é disponibilizada a dinamicidade da criação do Padrão. Basta clicar em <strong>Adicionar campo aqui</strong> e o usuário poderá criar um novo padrão, que será salvo para posterior uso. Caso o novo elemento do template seja o de <strong>Padrões relacionados</strong>, basta clicar no botão verde <strong>Relacionar padrões</strong>.": "1 - The dinamicity of the page will be avaiable for the creation of the pattern. Just click in <strong>Add field here</strong> and the user will be able to create a new template that will be saved. If the new element is <strong>Related patterns</strong>, just click on the green button <strong>Relate patterns</strong>.",
	"2 - Ao inserir um link coloque o endereço completo: <strong>http://meulink.com</strong>": "2 - When inserting a link put the complete address: <strong>http://mylink.com</strong>",
	"Visibilidade": "Visibility",
	"Público": "Public",
	"Privado": "Private",
	"Nome do novo Template": "New Template name",
	"Digite aqui o nome de seu novo Template": "Type here the name of your new Template",
	"Adicionar campo aqui": "Add field here",
	"Remover": "Remove",
	"Relacionar Padrões": "Relate Patterns",
	"Digite o nome do elemento": "Type the element name",
	"Digite aqui o conteúdo deste elemento": "Type here the new element name",
	"Criação de Nova Linguagem": "New Language",
	"Nome da Linguagem": "Language name",
	"Digite o nome da sua Linguagem": "Type your Language name",
	"Descrição da Linguagem": "Language description",
	"Criar Linguagem": "Create Language",
	"Edição de Linguagem": "Language Edition",
	"Relacionamento entre Linguagens e Padrões": "Relationship between Languages and Patterns",
	"Padrões relacionados a essa Linguagem": "Patterns related to this Languge",
	"Remover padrões desta linguagem": "Remove Patterns of this Language",
	"Excluir relacionamento": "Delete relationship",
	"Adicionar outros padrões a essa Linguagem (aqui entrará uma ferramenta de busca)": "Add another Patterns to this Languages (aqui entrará uma ferramenta de busca)",
	"Adicionar relacionamento": "Add relationship",
	"Relacionamento entre Linguagens": "Relationship between Languages",
	"Novo relacionamento de Linguagens": "New relationship between Languages",
	"Propriedades da Linguagem": "Language properties",
	"Salvar propriedades": "Save properties",
	"Deletar Linguagem": "Delete Language",
	"Linguagens relacionadas antes da edição": "Related Languages before edition",
	"Padrões mais utilizados": "Most used Patterns",
	"Padrão um": "Pattern one",
	"Aplicação": "Application",
	"Continuar lendo": "Learn more",
	"Padrão dois": "Pattern two",
	"Padrão três": "Pattern three",
	"Compartilhe suas práticas": "Share your educational Patterns",
	"Padrão Educacional é uma forma de educadores descreverem e compartilharem experiências adquiridas no contexto de ensino e aprendizagem. A ferramenta OpenEdu Patterns pode ser utilizada para cadastrar padrões, organizá-los em categorias e compartilhá-los para que outros educadores tenham acesso às práticas catalogadas.": "Educational Pattern is used by educators to share their acquired experiences in the educational context. OpenEdu Patterns can be used to register Patterns and Languages, organize them in categories and share with another educators.",
	"Linguagens mais vistas": "Most visited Languages",
	"Linguagem um": "Language one",
	"Linguagem dois": "Language two",
	"Linguagem três": "Language three",
	"Linguagem quatro": "Language four",
	"Linguagem cinco": "Language five",
	"Linguagem seis": "Language six",
	"Exibição de Linguagem": "Language display",
	"Editar Linguagem": "Edit Language",
	"Autor": "Author",
	"Data de criação": "Creation date",
	"Esta linguagem não possui padrões relacionados": "This Language has not related Patterns",
	"Linguagens relacionadas": "Related Languages",
	"Comentários": "Comments",
	"Você não está logado, para comentar efetue o": "You're not logged in, to comment",
	"Login": "Sign in",
	"Esta linguagem não existe": "This Language does not exist",
	"Linguagens populares": "Popular Languages",
	"Criar nova Linguagem": "Create new Language",
	"Faça seu Login": "Sign in",
	"Digite sua senha": "Type your password",
	"Login2": "Sign in",
	"Não possui uma conta?": "Doesn't have an account yet?",
	"Cadastre-se agora": "Register now",
	"Padrões populares": "Popular Patterns",
	"Criar novo Padrão": "Create new Pattern",
	"Exibição de Padrão": "Pattern display",
	"Exportar PDF": "Export PDF",
	"Editar Padrão": "Edit Pattern",
	"Este Padrão não existe": "This Pattern doesn't exist",
	"Bem vindo": "Welcome",
	"Faça upload de sua foto de perfil": "Upload your profile picture",
	"Alterar foto de perfil": "Change profile picture",
	"Apagar foto de perfil": "Delete profile picture",
	"Minhas Linguagens": "My Languages",
	"Meus Padrões": "My Patterns",
	"Pesquisa geral": "General search",
	"Nomes e conteúdos serão analisados": "Names, content and tags will be analyzed",
	"Padrão": "Pattern",
	"Linguagem": "Language",
	"Pesquisa refinada": "Refined search",
	"Pesquisa refinada  nos padrões": "Refined search in Patterns",
	"Apenas os campos selecionados serão analisados": "Only the selected fields will be analyzed",
	"Diagrama da Solução": "Solution diagram",
	"Resultados da pesquisa": "Search results",
	"Não foram encontrados resultados para esta pesquisa": "This search didn't return results",
	"Esta ferramenta está sendo desenvolvida por": "This website was developed by",
	"estudante do curso de Ciência da Computação da Universidade de São Paulo, sob a orientação da professora Elen Francine e colaboração de": "Computer Science student at University of São Paulo, under the guidance of the teacher Elen Francine and collaboration of",
	"Doutoranda no ICMC/USP": "PhD Candidate at University of São Paulo",
	"Padrões e Linguagens de Padrões": "Patterns and Languages",
	"A ideia de padrão surgiu a partir das investigações do professor arquiteto Christopher Alexander, da Universidade da Califórnia, em Berkeley, no seu livro “A Pattern Language”, no final da década de 70. Para Christopher, cada padrão descreve um problema que se repete, apresentando o núcleo da solução ou melhor forma para resolver tal problema. Dessa forma, o padrão pode ser usado por outras pessoas, em um contexto semelhante, mas que possuem o mesmo problema relacionado.": "The idea of Pattern came from the investigations of the architect Christopher Alexander, of Berkeley University, in his book “A Pattern Language”, in the late 1970s. For Christopher, each Pattern describes a problem that repeats, presenting the solution core or the best way to solve the problem. Thus, a pattern with the same problem can be used by other people in a similar context.",
	"De forma geral, um padrão possui um formato contendo geralmente nome, contexto, problema, solução.": "In general, a Pattern has the following elements: Name, Context, Problem and Solution.",
	"Um padrão também pode pertencer a uma categoria. Dessa forma, padrões com características comuns estão organizados.": "A Pattern can belong to a category. Thus, Patterns with similar properties are organized together.",
	"Outro conceito importante é o de Linguagem. Um conjunto de padrões, seus agrupamentos em categorias e o relacionamento entre padrões formam uma Linguagem de Padrões. A Linguagem de Padrões pode ser usada para resolver problemas em um contexto maior, por exemplo, o design, oferta e validação de uma aula ou um curso.": "Another important concept is Language. A group of Patterns, its groupings in categories and the relationship between Patterns make a Language. The Language can be used to solve problems in a bigger context, for example, the design, ofert and validation of a classroom.",
	"Tags": "Tags",
	"tags": "tags",
	"Tags (separe-as pressionando Enter ou com uma vírgula)": "Tags (separate them pressing Enter or using commas)",
	"Ajuda Busca Geral": "The text typed will be searched in Authors, titles and in the body of Languages and Patterns",
	"Ajuda Busca Refinada": "Choose elements of the most used patterns to filter you search",
	"Digite o nome que será exibido para a Linguagem": "Type the name that will be used to the Language",
	"Digite o nome da Linguagem que será exibido nas buscas": "Type the Language name that will be displayed on search",
	"Digite o nome da Linguagem que será exibida nas buscas": "Type the Language name that will be displayed on search",
	"Caso escolha privado apenas você poderá visualizar": "If you choose private, only you can see the Language",
	"A descrição facilitará a compreensão da Linguagem por outros usuários": "The description will help other users to understand the Language",
	"Adicione tags que relacionem o assunto para facilitar as buscas": "Add tags that relate the context to help on future searches",
	"O template definirá quais campos o seu padrão possuirá": "The template will define which fields your pattern will use",
	"Este template criado ficará disponível para você na próxima criação de um padrão": "This created template will be available in the next time you create a pattern",
	"Esta ferramenta foi desenvolvida por <a href='https://www.linkedin.com/in/gabriel-nicolau-07147b121/'>Gabriel Santos Nicolau</a>, estudante do curso de Ciência da Computação da Universidade de São Paulo, sob a orientação da Profa. Dra. Ellen Francine Barbosa e da doutoranda <a href='https://www.linkedin.com/in/mlfioravanti/'>Maria Lydia Fioravanti</a>.": "This tool was developed by <a href='https://www.linkedin.com/in/gabriel-nicolau-07147b121/'>Gabriel Santos Nicolau</a>, Computer Science undergraduate student at University of São Paulo, under the supervision of Prof. Dr. Elen Francine and PhD candidate <a href='https://www.linkedin.com/in/mlfioravanti/'>Maria Lydia Fioravanti</a>.",
	"Em termos gerais, um padrão descreve uma solução para um problema de maneira recorrente. No entanto, a história inicial dos padrões de software começa não com um cientista da computação, mas com um arquiteto de construção, Christopher Alexander, que reconheceu que um conjunto recorrente de problemas foi encontrado sempre que um edifício foi projetado no final dos anos 70.<br><br>Os padrões fornecem um método para capturar e comunicar conhecimento em um domínio específico, como a pedagogia. Nesse contexto, Bergin definiu padrões pedagógicos como aqueles que tentam captar conhecimento especializado da prática do ensino e da aprendizagem. A intenção de tais padrões é capturar a essência da prática de uma forma compacta que pode ser facilmente comunicada àqueles que precisam do conhecimento.<br><br>Um padrão resolve um problema, mas sua aplicação pode gerar outros problemas, que podem ser resolvidos através do uso de outros padrões. Em resumo, nenhum padrão é uma entidade isolada. Portanto, deve-se pensar em maneiras de agrupar padrões existentes de acordo com algum critério, a fim de facilitar sua recuperação e reutilização. Uma linguagem de padrões é uma maneira de subdividir um problema geral e sua solução complexa em vários problemas relacionados e suas respectivas soluções. Cada linguagem de padrão resolve um problema específico no contexto comum compartilhado pela linguagem.": "In general terms, a pattern describes a solution to a problem in a recurring manner. However, the early history of software patterns begins not with a computer scientist but a building architect, Christopher Alexander, who recognized that a recurring set of problems were encountered whenever a building was designed in the late 70's. <br><br> Patterns provide a method for capturing and communicating knowledge in a specific domain, such as pedagogy. In this context, Bergin defined pedagogical patterns as those which try to capture expert knowledge of the practice of teaching and learning. The intent of such patterns is to capture the essence of the practice in a compact form that can be easily communicated to those who need the knowledge. <br><br> A pattern solves a problem, but its application can generate other problems, that can be solved through the use of other patterns. In short, no pattern is an isolated entity. Therefore, we must think of ways to group existing patterns according to some criterion, in order to facilitate their recovery and reuse. A pattern language is a way of subdividing a general problem and its complex solution into a number of related problems and their respective solutions. Each pattern language solves a specific problem in the common context shared by the language.",
	"Relacionamento de Linguagens": "Languages relationship",
	"Relacionamento de padrões": "Pattern relationship",
	"Selecione os novos padrões a serem relacionados ou clique no X para remover uma relação": "Select new patterns to relate or click on the X to remove a relationship",
	"Selecione as novas linguagens a serem relacionados e clique no X para remover uma relação": "Select new languages to relate or click on the X to remove a relationship",
	"Edite aqui as informações básicas da Linguagem": "Edit the basic information of your language",
	"Faça aqui seu novo relacionamento de Padrões": "Make your new pattern relationship",
	"Sem linguagem": "No language available",
	"Carregando...": "Loading...",
	"Processando...": "Processing...",
	"Pesquisa": "Search",
	"Nenhuma linguagem encontrada": "No matching records found",
	"Primeiro": "First",
	"Último": "Last",
	"Próximo": "Next",
	"Anterior": "Previous",
	"Ative para ordenar em ordem crescente": "Activate to sort column ascending",
	"Ative para ordenar em ordem decrescente": "Activate to sort column descending",
	"Noma da Linguagem": "Language name",
	"Comentário": "Comments",
	"Data": "Date",
	"Ordenar colunas em ordem crescente": "Activate to sort column ascending",
	"Ordenar colunas em ordem decrescente": "Activate to sort column descending",
	"Nome do Padrão": "Pattern name",
	"Você não pode adicionar mais campos de relacionamento": "You can't add more relationship elements",
	"Alterar foto": "Change photo",
	"Upload": "Upload",
	"Comentar": "Comment",
	"Enviar": "Enviar"
}